sjbiwa/bwos/arch/arm_cm/board/nrf9160/CMSIS_5/ARM.CMSIS.pdsc
    <condition id="CM33_BE_ARMCC">
      <description>Cortex-M33 processor based device in big endian mode for the Arm Compiler</description>
      <require condition="CM33_ARMCC"/>
      <require Dendian="Big-endian"/>
    </condition>

    <condition id="CM33_FP_ARMCC">
      <description>Cortex-M33 processor based device using Floating Point Unit for the Arm Compiler</description>
      <require condition="CM33_FP"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="CM33_FP_LE_ARMCC">
      <description>Cortex-M33 processor based device using Floating Point Unit in little endian mode for the Arm Compiler</description>
      <require condition="CM33_FP_ARMCC"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="CM33_FP_BE_ARMCC">
      <description>Cortex-M33 processor based device using Floating Point Unit in big endian mode for the Arm Compiler</description>
      <require condition="CM33_FP_ARMCC"/>
      <require Dendian="Big-endian"/>
    </condition>

    <condition id="CM33_NODSP_NOFPU_ARMCC">
      <description>Cortex-M33 processor, no DSP, no FPU, Arm Compiler</description>
      <require condition="CM33_NODSP_NOFPU"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="CM33_DSP_NOFPU_ARMCC">
      <description>Cortex-M33 processor, DSP, no FPU, Arm Compiler</description>
      <require condition="CM33_DSP_NOFPU"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="CM33_NODSP_SP_ARMCC">
      <description>Cortex-M33 processor, no DSP, SP FPU, Arm Compiler</description>
      <require condition="CM33_NODSP_SP"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="CM33_DSP_SP_ARMCC">
      <description>Cortex-M33 processor, DSP, SP FPU, Arm Compiler</description>
      <require condition="CM33_DSP_SP"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="CM33_NODSP_NOFPU_LE_ARMCC">
      <description>Cortex-M33 processor, little endian, no DSP, no FPU, Arm Compiler</description>
      <require condition="CM33_NODSP_NOFPU_ARMCC"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="CM33_DSP_NOFPU_LE_ARMCC">
      <description>Cortex-M33 processor, little endian, DSP, no FPU, Arm Compiler</description>
      <require condition="CM33_DSP_NOFPU_ARMCC"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="CM33_NODSP_SP_LE_ARMCC">
      <description>Cortex-M33 processor, little endian, no DSP, SP FPU, Arm Compiler</description>
      <require condition="CM33_NODSP_SP_ARMCC"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="CM33_DSP_SP_LE_ARMCC">
      <description>Cortex-M33 processor, little endian, DSP, SP FPU, Arm Compiler</description>
      <require condition="CM33_DSP_SP_ARMCC"/>
      <require Dendian="Little-endian"/>
    </condition>

    <condition id="CM35P_ARMCC">
      <description>Cortex-M35P processor based device for the Arm Compiler</description>
      <require condition="CM35P"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="CM35P_LE_ARMCC">
      <description>Cortex-M35P processor based device in little endian mode for the Arm Compiler</description>
      <require condition="CM35P_ARMCC"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="CM35P_BE_ARMCC">
      <description>Cortex-M35P processor based device in big endian mode for the Arm Compiler</description>
      <require condition="CM35P_ARMCC"/>
      <require Dendian="Big-endian"/>
    </condition>

    <condition id="CM35P_FP_ARMCC">
      <description>Cortex-M35P processor based device using Floating Point Unit for the Arm Compiler</description>
      <require condition="CM35P_FP"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="CM35P_FP_LE_ARMCC">
      <description>Cortex-M35P processor based device using Floating Point Unit in little endian mode for the Arm Compiler</description>
      <require condition="CM35P_FP_ARMCC"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="CM35P_FP_BE_ARMCC">
      <description>Cortex-M35P processor based device using Floating Point Unit in big endian mode for the Arm Compiler</description>
      <require condition="CM35P_FP_ARMCC"/>
      <require Dendian="Big-endian"/>
    </condition>

    <condition id="CM35P_NODSP_NOFPU_ARMCC">
      <description>Cortex-M35P processor, no DSP, no FPU, Arm Compiler</description>
      <require condition="CM35P_NODSP_NOFPU"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="CM35P_DSP_NOFPU_ARMCC">
      <description>Cortex-M35P processor, DSP, no FPU, Arm Compiler</description>
      <require condition="CM35P_DSP_NOFPU"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="CM35P_NODSP_SP_ARMCC">
      <description>Cortex-M35P processor, no DSP, SP FPU, Arm Compiler</description>
      <require condition="CM35P_NODSP_SP"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="CM35P_DSP_SP_ARMCC">
      <description>Cortex-M35P processor, DSP, SP FPU, Arm Compiler</description>
      <require condition="CM35P_DSP_SP"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="CM35P_NODSP_NOFPU_LE_ARMCC">
      <description>Cortex-M35P processor, little endian, no DSP, no FPU, Arm Compiler</description>
      <require condition="CM35P_NODSP_NOFPU_ARMCC"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="CM35P_DSP_NOFPU_LE_ARMCC">
      <description>Cortex-M35P processor, little endian, DSP, no FPU, Arm Compiler</description>
      <require condition="CM35P_DSP_NOFPU_ARMCC"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="CM35P_NODSP_SP_LE_ARMCC">
      <description>Cortex-M35P processor, little endian, no DSP, SP FPU, Arm Compiler</description>
      <require condition="CM35P_NODSP_SP_ARMCC"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="CM35P_DSP_SP_LE_ARMCC">
      <description>Cortex-M35P processor, little endian, DSP, SP FPU, Arm Compiler</description>
      <require condition="CM35P_DSP_SP_ARMCC"/>
      <require Dendian="Little-endian"/>
    </condition>

