sjbiwa/bwos/arch/arm_cm/board/nrf9160/CMSIS_5/ARM.CMSIS.pdsc
    <condition id="CM4_LE_GCC">
      <description>Cortex-M4 processor based device in little endian mode for the GCC Compiler</description>
      <require condition="CM4_GCC"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="CM4_BE_GCC">
      <description>Cortex-M4 processor based device in big endian mode for the GCC Compiler</description>
      <require condition="CM4_GCC"/>
      <require Dendian="Big-endian"/>
    </condition>

    <condition id="CM4_FP_GCC">
      <description>Cortex-M4 processor based device using Floating Point Unit for the GCC Compiler</description>
      <require condition="CM4_FP"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="CM4_FP_LE_GCC">
      <description>Cortex-M4 processor based device using Floating Point Unit in little endian mode for the GCC Compiler</description>
      <require condition="CM4_FP_GCC"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="CM4_FP_BE_GCC">
      <description>Cortex-M4 processor based device using Floating Point Unit in big endian mode for the GCC Compiler</description>
      <require condition="CM4_FP_GCC"/>
      <require Dendian="Big-endian"/>
    </condition>

    <condition id="CM7_GCC">
      <description>Cortex-M7 processor based device for the GCC Compiler</description>
      <require condition="CM7"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="CM7_LE_GCC">
      <description>Cortex-M7 processor based device in little endian mode for the GCC Compiler</description>
      <require condition="CM7_GCC"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="CM7_BE_GCC">
      <description>Cortex-M7 processor based device in big endian mode for the GCC Compiler</description>
      <require condition="CM7_GCC"/>
      <require Dendian="Big-endian"/>
    </condition>

    <condition id="CM7_FP_GCC">
      <description>Cortex-M7 processor based device using Floating Point Unit for the GCC Compiler</description>
      <require condition="CM7_FP"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="CM7_FP_LE_GCC">
      <description>Cortex-M7 processor based device using Floating Point Unit in little endian mode for the GCC Compiler</description>
      <require condition="CM7_FP_GCC"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="CM7_FP_BE_GCC">
      <description>Cortex-M7 processor based device using Floating Point Unit in big endian mode for the GCC Compiler</description>
      <require condition="CM7_FP_GCC"/>
      <require Dendian="Big-endian"/>
    </condition>

    <condition id="CM7_SP_GCC">
      <description>Cortex-M7 processor based device using Floating Point Unit (SP) for the GCC Compiler</description>
      <require condition="CM7_SP"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="CM7_SP_LE_GCC">
      <description>Cortex-M7 processor based device using Floating Point Unit (SP) in little endian mode for the GCC Compiler</description>
      <require condition="CM7_SP_GCC"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="CM7_SP_BE_GCC">
      <description>Cortex-M7 processor based device using Floating Point Unit (SP) in big endian mode for the GCC Compiler</description>
      <require condition="CM7_SP_GCC"/>
      <require Dendian="Big-endian"/>
    </condition>

    <condition id="CM7_DP_GCC">
      <description>Cortex-M7 processor based device using Floating Point Unit (DP) for the GCC Compiler</description>
      <require condition="CM7_DP"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="CM7_DP_LE_GCC">
      <description>Cortex-M7 processor based device using Floating Point Unit (DP) in little endian mode for the GCC Compiler</description>
      <require condition="CM7_DP_GCC"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="CM7_DP_BE_GCC">
      <description>Cortex-M7 processor based device using Floating Point Unit (DP) in big endian mode for the GCC Compiler</description>
      <require condition="CM7_DP_GCC"/>
      <require Dendian="Big-endian"/>
    </condition>

    <condition id="CM23_GCC">
      <description>Cortex-M23 processor based device for the GCC Compiler</description>
      <require condition="CM23"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="CM23_LE_GCC">
      <description>Cortex-M23 processor based device in little endian mode for the GCC Compiler</description>
      <require condition="CM23_GCC"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="CM23_BE_GCC">
      <description>Cortex-M23 processor based device in big endian mode for the GCC Compiler</description>
      <require condition="CM23_GCC"/>
      <require Dendian="Big-endian"/>
    </condition>

    <condition id="CM33_GCC">
      <description>Cortex-M33 processor based device for the GCC Compiler</description>
      <require condition="CM33"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="CM33_LE_GCC">
      <description>Cortex-M33 processor based device in little endian mode for the GCC Compiler</description>
      <require condition="CM33_GCC"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="CM33_BE_GCC">
      <description>Cortex-M33 processor based device in big endian mode for the GCC Compiler</description>
      <require condition="CM33_GCC"/>
      <require Dendian="Big-endian"/>
    </condition>

    <condition id="CM33_FP_GCC">
      <description>Cortex-M33 processor based device using Floating Point Unit for the GCC Compiler</description>
      <require condition="CM33_FP"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="CM33_FP_LE_GCC">
      <description>Cortex-M33 processor based device using Floating Point Unit in little endian mode for the GCC Compiler</description>
      <require condition="CM33_FP_GCC"/>
      <require Dendian="Little-endian"/>
    </condition>
