sjbiwa/bwos/arch/arm_cm/board/nrf9160/CMSIS_5/ARM.CMSIS.pdsc
    <condition id="CM33_FP_BE_GCC">
      <description>Cortex-M33 processor based device using Floating Point Unit in big endian mode for the GCC Compiler</description>
      <require condition="CM33_FP_GCC"/>
      <require Dendian="Big-endian"/>
    </condition>

    <condition id="CM33_NODSP_NOFPU_GCC">
      <description>CM33, no DSP, no FPU, GCC Compiler</description>
      <require condition="CM33_NODSP_NOFPU"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="CM33_DSP_NOFPU_GCC">
      <description>CM33, DSP, no FPU, GCC Compiler</description>
      <require condition="CM33_DSP_NOFPU"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="CM33_NODSP_SP_GCC">
      <description>CM33, no DSP, SP FPU, GCC Compiler</description>
      <require condition="CM33_NODSP_SP"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="CM33_DSP_SP_GCC">
      <description>CM33, DSP, SP FPU, GCC Compiler</description>
      <require condition="CM33_DSP_SP"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="CM33_NODSP_NOFPU_LE_GCC">
      <description>CM33, little endian, no DSP, no FPU, GCC Compiler</description>
      <require condition="CM33_NODSP_NOFPU_GCC"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="CM33_DSP_NOFPU_LE_GCC">
      <description>CM33, little endian, DSP, no FPU, GCC Compiler</description>
      <require condition="CM33_DSP_NOFPU_GCC"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="CM33_NODSP_SP_LE_GCC">
      <description>CM33, little endian, no DSP, SP FPU, GCC Compiler</description>
      <require condition="CM33_NODSP_SP_GCC"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="CM33_DSP_SP_LE_GCC">
      <description>CM33, little endian, DSP, SP FPU, GCC Compiler</description>
      <require condition="CM33_DSP_SP_GCC"/>
      <require Dendian="Little-endian"/>
    </condition>

    <condition id="CM35P_GCC">
      <description>Cortex-M35P processor based device for the GCC Compiler</description>
      <require condition="CM35P"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="CM35P_LE_GCC">
      <description>Cortex-M35P processor based device in little endian mode for the GCC Compiler</description>
      <require condition="CM35P_GCC"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="CM35P_BE_GCC">
      <description>Cortex-M35P processor based device in big endian mode for the GCC Compiler</description>
      <require condition="CM35P_GCC"/>
      <require Dendian="Big-endian"/>
    </condition>

    <condition id="CM35P_FP_GCC">
      <description>Cortex-M35P processor based device using Floating Point Unit for the GCC Compiler</description>
      <require condition="CM35P_FP"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="CM35P_FP_LE_GCC">
      <description>Cortex-M35P processor based device using Floating Point Unit in little endian mode for the GCC Compiler</description>
      <require condition="CM35P_FP_GCC"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="CM35P_FP_BE_GCC">
      <description>Cortex-M35P processor based device using Floating Point Unit in big endian mode for the GCC Compiler</description>
      <require condition="CM35P_FP_GCC"/>
      <require Dendian="Big-endian"/>
    </condition>

    <condition id="CM35P_NODSP_NOFPU_GCC">
      <description>CM35P, no DSP, no FPU, GCC Compiler</description>
      <require condition="CM35P_NODSP_NOFPU"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="CM35P_DSP_NOFPU_GCC">
      <description>CM35P, DSP, no FPU, GCC Compiler</description>
      <require condition="CM35P_DSP_NOFPU"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="CM35P_NODSP_SP_GCC">
      <description>CM35P, no DSP, SP FPU, GCC Compiler</description>
      <require condition="CM35P_NODSP_SP"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="CM35P_DSP_SP_GCC">
      <description>CM35P, DSP, SP FPU, GCC Compiler</description>
      <require condition="CM35P_DSP_SP"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="CM35P_NODSP_NOFPU_LE_GCC">
      <description>CM35P, little endian, no DSP, no FPU, GCC Compiler</description>
      <require condition="CM35P_NODSP_NOFPU_GCC"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="CM35P_DSP_NOFPU_LE_GCC">
      <description>CM35P, little endian, DSP, no FPU, GCC Compiler</description>
      <require condition="CM35P_DSP_NOFPU_GCC"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="CM35P_NODSP_SP_LE_GCC">
      <description>CM35P, little endian, no DSP, SP FPU, GCC Compiler</description>
      <require condition="CM35P_NODSP_SP_GCC"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="CM35P_DSP_SP_LE_GCC">
      <description>CM35P, little endian, DSP, SP FPU, GCC Compiler</description>
      <require condition="CM35P_DSP_SP_GCC"/>
      <require Dendian="Little-endian"/>
    </condition>

    <condition id="ARMv8MBL_GCC">
      <description>Armv8-M Baseline processor based device for the GCC Compiler</description>
      <require condition="ARMv8MBL"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="ARMv8MBL_LE_GCC">
      <description>Armv8-M Baseline processor based device in little endian mode for the GCC Compiler</description>
      <require condition="ARMv8MBL_GCC"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="ARMv8MBL_BE_GCC">
      <description>Armv8-M Baseline processor based device in big endian mode for the GCC Compiler</description>
      <require condition="ARMv8MBL_GCC"/>
      <require Dendian="Big-endian"/>
    </condition>

    <condition id="ARMv8MML_GCC">
      <description>Armv8-M Mainline processor based device for the GCC Compiler</description>
      <require condition="ARMv8MML"/>
      <require Tcompiler="GCC"/>
    </condition>
