sjbiwa/bwos/arch/arm_cm/board/nrf9160/CMSIS_5/ARM.CMSIS.pdsc
    <condition id="CM4_FP_IAR">
      <description>Cortex-M4 processor based device using Floating Point Unit for the IAR Compiler</description>
      <require condition="CM4_FP"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="CM4_FP_LE_IAR">
      <description>Cortex-M4 processor based device using Floating Point Unit in little endian mode for the IAR Compiler</description>
      <require condition="CM4_FP_IAR"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="CM4_FP_BE_IAR">
      <description>Cortex-M4 processor based device using Floating Point Unit in big endian mode for the IAR Compiler</description>
      <require condition="CM4_FP_IAR"/>
      <require Dendian="Big-endian"/>
    </condition>

    <condition id="CM7_IAR">
      <description>Cortex-M7 processor based device for the IAR Compiler</description>
      <require condition="CM7"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="CM7_LE_IAR">
      <description>Cortex-M7 processor based device in little endian mode for the IAR Compiler</description>
      <require condition="CM7_IAR"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="CM7_BE_IAR">
      <description>Cortex-M7 processor based device in big endian mode for the IAR Compiler</description>
      <require condition="CM7_IAR"/>
      <require Dendian="Big-endian"/>
    </condition>

    <condition id="CM7_FP_IAR">
      <description>Cortex-M7 processor based device using Floating Point Unit for the IAR Compiler</description>
      <require condition="CM7_FP"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="CM7_FP_LE_IAR">
      <description>Cortex-M7 processor based device using Floating Point Unit in little endian mode for the IAR Compiler</description>
      <require condition="CM7_FP_IAR"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="CM7_FP_BE_IAR">
      <description>Cortex-M7 processor based device using Floating Point Unit in big endian mode for the IAR Compiler</description>
      <require condition="CM7_FP_IAR"/>
      <require Dendian="Big-endian"/>
    </condition>

    <condition id="CM7_SP_IAR">
      <description>Cortex-M7 processor based device using Floating Point Unit (SP) for the IAR Compiler</description>
      <require condition="CM7_SP"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="CM7_SP_LE_IAR">
      <description>Cortex-M7 processor based device using Floating Point Unit (SP) in little endian mode for the IAR Compiler</description>
      <require condition="CM7_SP_IAR"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="CM7_SP_BE_IAR">
      <description>Cortex-M7 processor based device using Floating Point Unit (SP) in big endian mode for the IAR Compiler</description>
      <require condition="CM7_SP_IAR"/>
      <require Dendian="Big-endian"/>
    </condition>

    <condition id="CM7_DP_IAR">
      <description>Cortex-M7 processor based device using Floating Point Unit (DP) for the IAR Compiler</description>
      <require condition="CM7_DP"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="CM7_DP_LE_IAR">
      <description>Cortex-M7 processor based device using Floating Point Unit (DP) in little endian mode for the IAR Compiler</description>
      <require condition="CM7_DP_IAR"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="CM7_DP_BE_IAR">
      <description>Cortex-M7 processor based device using Floating Point Unit (DP) in big endian mode for the IAR Compiler</description>
      <require condition="CM7_DP_IAR"/>
      <require Dendian="Big-endian"/>
    </condition>

    <condition id="CM23_IAR">
      <description>Cortex-M23 processor based device for the IAR Compiler</description>
      <require condition="CM23"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="CM23_LE_IAR">
      <description>Cortex-M23 processor based device in little endian mode for the IAR Compiler</description>
      <require condition="CM23_IAR"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="CM23_BE_IAR">
      <description>Cortex-M23 processor based device in big endian mode for the IAR Compiler</description>
      <require condition="CM23_IAR"/>
      <require Dendian="Big-endian"/>
    </condition>

    <condition id="CM33_IAR">
      <description>Cortex-M33 processor based device for the IAR Compiler</description>
      <require condition="CM33"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="CM33_LE_IAR">
      <description>Cortex-M33 processor based device in little endian mode for the IAR Compiler</description>
      <require condition="CM33_IAR"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="CM33_BE_IAR">
      <description>Cortex-M33 processor based device in big endian mode for the IAR Compiler</description>
      <require condition="CM33_IAR"/>
      <require Dendian="Big-endian"/>
    </condition>

    <condition id="CM33_FP_IAR">
      <description>Cortex-M33 processor based device using Floating Point Unit for the IAR Compiler</description>
      <require condition="CM33_FP"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="CM33_FP_LE_IAR">
      <description>Cortex-M33 processor based device using Floating Point Unit in little endian mode for the IAR Compiler</description>
      <require condition="CM33_FP_IAR"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="CM33_FP_BE_IAR">
      <description>Cortex-M33 processor based device using Floating Point Unit in big endian mode for the IAR Compiler</description>
      <require condition="CM33_FP_IAR"/>
      <require Dendian="Big-endian"/>
    </condition>

    <condition id="CM33_NODSP_NOFPU_IAR">
      <description>CM33, no DSP, no FPU, IAR Compiler</description>
      <require condition="CM33_NODSP_NOFPU"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="CM33_DSP_NOFPU_IAR">
      <description>CM33, DSP, no FPU, IAR Compiler</description>
      <require condition="CM33_DSP_NOFPU"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="CM33_NODSP_SP_IAR">
      <description>CM33, no DSP, SP FPU, IAR Compiler</description>
      <require condition="CM33_NODSP_SP"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="CM33_DSP_SP_IAR">
      <description>CM33, DSP, SP FPU, IAR Compiler</description>
      <require condition="CM33_DSP_SP"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="CM33_NODSP_NOFPU_LE_IAR">
      <description>CM33, little endian, no DSP, no FPU, IAR Compiler</description>
      <require condition="CM33_NODSP_NOFPU_IAR"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="CM33_DSP_NOFPU_LE_IAR">
      <description>CM33, little endian, DSP, no FPU, IAR Compiler</description>
      <require condition="CM33_DSP_NOFPU_IAR"/>
      <require Dendian="Little-endian"/>
    </condition>
