sjbiwa/bwos/arch/arm_cm/board/nrf9160/CMSIS_5/ARM.CMSIS.pdsc
    <condition id="CM33_NODSP_SP_LE_IAR">
      <description>CM33, little endian, no DSP, SP FPU, IAR Compiler</description>
      <require condition="CM33_NODSP_SP_IAR"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="CM33_DSP_SP_LE_IAR">
      <description>CM33, little endian, DSP, SP FPU, IAR Compiler</description>
      <require condition="CM33_DSP_SP_IAR"/>
      <require Dendian="Little-endian"/>
    </condition>

    <condition id="CM35P_IAR">
      <description>Cortex-M35P processor based device for the IAR Compiler</description>
      <require condition="CM35P"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="CM35P_LE_IAR">
      <description>Cortex-M35P processor based device in little endian mode for the IAR Compiler</description>
      <require condition="CM35P_IAR"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="CM35P_BE_IAR">
      <description>Cortex-M35P processor based device in big endian mode for the IAR Compiler</description>
      <require condition="CM35P_IAR"/>
      <require Dendian="Big-endian"/>
    </condition>

    <condition id="CM35P_FP_IAR">
      <description>Cortex-M35P processor based device using Floating Point Unit for the IAR Compiler</description>
      <require condition="CM35P_FP"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="CM35P_FP_LE_IAR">
      <description>Cortex-M35P processor based device using Floating Point Unit in little endian mode for the IAR Compiler</description>
      <require condition="CM35P_FP_IAR"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="CM35P_FP_BE_IAR">
      <description>Cortex-M35P processor based device using Floating Point Unit in big endian mode for the IAR Compiler</description>
      <require condition="CM35P_FP_IAR"/>
      <require Dendian="Big-endian"/>
    </condition>

    <condition id="CM35P_NODSP_NOFPU_IAR">
      <description>CM35P, no DSP, no FPU, IAR Compiler</description>
      <require condition="CM35P_NODSP_NOFPU"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="CM35P_DSP_NOFPU_IAR">
      <description>CM35P, DSP, no FPU, IAR Compiler</description>
      <require condition="CM35P_DSP_NOFPU"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="CM35P_NODSP_SP_IAR">
      <description>CM35P, no DSP, SP FPU, IAR Compiler</description>
      <require condition="CM35P_NODSP_SP"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="CM35P_DSP_SP_IAR">
      <description>CM35P, DSP, SP FPU, IAR Compiler</description>
      <require condition="CM35P_DSP_SP"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="CM35P_NODSP_NOFPU_LE_IAR">
      <description>CM35P, little endian, no DSP, no FPU, IAR Compiler</description>
      <require condition="CM35P_NODSP_NOFPU_IAR"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="CM35P_DSP_NOFPU_LE_IAR">
      <description>CM35P, little endian, DSP, no FPU, IAR Compiler</description>
      <require condition="CM35P_DSP_NOFPU_IAR"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="CM35P_NODSP_SP_LE_IAR">
      <description>CM35P, little endian, no DSP, SP FPU, IAR Compiler</description>
      <require condition="CM35P_NODSP_SP_IAR"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="CM35P_DSP_SP_LE_IAR">
      <description>CM35P, little endian, DSP, SP FPU, IAR Compiler</description>
      <require condition="CM35P_DSP_SP_IAR"/>
      <require Dendian="Little-endian"/>
    </condition>

    <condition id="ARMv8MBL_IAR">
      <description>Armv8-M Baseline processor based device for the IAR Compiler</description>
      <require condition="ARMv8MBL"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="ARMv8MBL_LE_IAR">
      <description>Armv8-M Baseline processor based device in little endian mode for the IAR Compiler</description>
      <require condition="ARMv8MBL_IAR"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="ARMv8MBL_BE_IAR">
      <description>Armv8-M Baseline processor based device in big endian mode for the IAR Compiler</description>
      <require condition="ARMv8MBL_IAR"/>
      <require Dendian="Big-endian"/>
    </condition>

    <condition id="ARMv8MML_IAR">
      <description>Armv8-M Mainline processor based device for the IAR Compiler</description>
      <require condition="ARMv8MML"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="ARMv8MML_LE_IAR">
      <description>Armv8-M Mainline processor based device in little endian mode for the IAR Compiler</description>
      <require condition="ARMv8MML_IAR"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="ARMv8MML_BE_IAR">
      <description>Armv8-M Mainline processor based device in big endian mode for the IAR Compiler</description>
      <require condition="ARMv8MML_IAR"/>
      <require Dendian="Big-endian"/>
    </condition>

    <condition id="ARMv8MML_FP_IAR">
      <description>Armv8-M Mainline processor based device using Floating Point Unit for the IAR Compiler</description>
      <require condition="ARMv8MML_FP"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="ARMv8MML_FP_LE_IAR">
      <description>Armv8-M Mainline processor based device using Floating Point Unit in little endian mode for the IAR Compiler</description>
      <require condition="ARMv8MML_FP_IAR"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="ARMv8MML_FP_BE_IAR">
      <description>Armv8-M Mainline processor based device using Floating Point Unit in big endian mode for the IAR Compiler</description>
      <require condition="ARMv8MML_FP_IAR"/>
      <require Dendian="Big-endian"/>
    </condition>

    <condition id="ARMv8MML_NODSP_NOFPU_IAR">
      <description>Armv8-M Mainline, no DSP, no FPU, IAR Compiler</description>
      <require condition="ARMv8MML_NODSP_NOFPU"/>
      <require Tcompiler="IAR"/>
    </condition>
