sjbiwa/bwos/arch/arm_cm/board/nrf9160/CMSIS_5/ARM.CMSIS.pdsc
    <condition id="ARMv8MML_DSP_NOFPU_IAR">
      <description>Armv8-M Mainline, DSP, no FPU, IAR Compiler</description>
      <require condition="ARMv8MML_DSP_NOFPU"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="ARMv8MML_NODSP_SP_IAR">
      <description>Armv8-M Mainline, no DSP, SP FPU, IAR Compiler</description>
      <require condition="ARMv8MML_NODSP_SP"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="ARMv8MML_DSP_SP_IAR">
      <description>Armv8-M Mainline, DSP, SP FPU, IAR Compiler</description>
      <require condition="ARMv8MML_DSP_SP"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="ARMv8MML_NODSP_NOFPU_LE_IAR">
      <description>Armv8-M Mainline, little endian, no DSP, no FPU, IAR Compiler</description>
      <require condition="ARMv8MML_NODSP_NOFPU_IAR"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="ARMv8MML_DSP_NOFPU_LE_IAR">
      <description>Armv8-M Mainline, little endian, DSP, no FPU, IAR Compiler</description>
      <require condition="ARMv8MML_DSP_NOFPU_IAR"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="ARMv8MML_NODSP_SP_LE_IAR">
      <description>Armv8-M Mainline, little endian, no DSP, SP FPU, IAR Compiler</description>
      <require condition="ARMv8MML_NODSP_SP_IAR"/>
      <require Dendian="Little-endian"/>
    </condition>
    <condition id="ARMv8MML_DSP_SP_LE_IAR">
      <description>Armv8-M Mainline, little endian, DSP, SP FPU, IAR Compiler</description>
      <require condition="ARMv8MML_DSP_SP_IAR"/>
      <require Dendian="Little-endian"/>
    </condition>

    <!-- conditions selecting single devices and CMSIS Core -->
    <!-- used for component startup, GCC version is used for C-Startup -->
    <condition id="ARMCM0 CMSIS">
      <description>Generic Arm Cortex-M0 device startup and depends on CMSIS Core</description>
      <require Dvendor="ARM:82" Dname="ARMCM0"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="ARMCM0 CMSIS GCC">
      <description>Generic ARM Cortex-M0 device startup and depends on CMSIS Core requiring GCC</description>
      <require condition="ARMCM0 CMSIS"/>
      <require condition="GCC"/>
    </condition>

    <condition id="ARMCM0+ CMSIS">
      <description>Generic Arm Cortex-M0+ device startup and depends on CMSIS Core</description>
      <require Dvendor="ARM:82" Dname="ARMCM0P*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="ARMCM0+ CMSIS GCC">
      <description>Generic Arm Cortex-M0+ device startup and depends CMSIS Core requiring GCC</description>
      <require condition="ARMCM0+ CMSIS"/>
      <require condition="GCC"/>
    </condition>

    <condition id="ARMCM1 CMSIS">
      <description>Generic Arm Cortex-M1 device startup and depends on CMSIS Core</description>
      <require Dvendor="ARM:82" Dname="ARMCM1"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="ARMCM1 CMSIS GCC">
      <description>Generic ARM Cortex-M1 device startup and depends on CMSIS Core requiring GCC</description>
      <require condition="ARMCM1 CMSIS"/>
      <require condition="GCC"/>
    </condition>

    <condition id="ARMCM3 CMSIS">
      <description>Generic Arm Cortex-M3 device startup and depends on CMSIS Core</description>
      <require Dvendor="ARM:82" Dname="ARMCM3"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="ARMCM3 CMSIS GCC">
      <description>Generic Arm Cortex-M3 device startup and depends on CMSIS Core requiring GCC</description>
      <require condition="ARMCM3 CMSIS"/>
      <require condition="GCC"/>
    </condition>

    <condition id="ARMCM4 CMSIS">
      <description>Generic Arm Cortex-M4 device startup and depends on CMSIS Core</description>
      <require Dvendor="ARM:82" Dname="ARMCM4*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="ARMCM4 CMSIS GCC">
      <description>Generic Arm Cortex-M4 device startup and depends on CMSIS Core requiring GCC</description>
      <require condition="ARMCM4 CMSIS"/>
      <require condition="GCC"/>
    </condition>

    <condition id="ARMCM7 CMSIS">
      <description>Generic Arm Cortex-M7 device startup and depends on CMSIS Core</description>
      <require Dvendor="ARM:82" Dname="ARMCM7*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="ARMCM7 CMSIS GCC">
      <description>Generic Arm Cortex-M7 device startup and depends on CMSIS Core requiring GCC</description>
      <require condition="ARMCM7 CMSIS"/>
      <require condition="GCC"/>
    </condition>

    <condition id="ARMCM23 CMSIS">
      <description>Generic Arm Cortex-M23 device startup and depends on CMSIS Core</description>
      <require Dvendor="ARM:82" Dname="ARMCM23*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="ARMCM23 CMSIS GCC">
      <description>Generic Arm Cortex-M23 device startup and depends on CMSIS Core requiring GCC</description>
      <require condition="ARMCM23 CMSIS"/>
      <require condition="GCC"/>
    </condition>

    <condition id="ARMCM33 CMSIS">
      <description>Generic Arm Cortex-M33 device startup and depends on CMSIS Core</description>
      <require Dvendor="ARM:82" Dname="ARMCM33*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="ARMCM33 CMSIS GCC">
      <description>Generic Arm Cortex-M33 device startup and depends on CMSIS Core requiring GCC</description>
      <require condition="ARMCM33 CMSIS"/>
      <require condition="GCC"/>
    </condition>

    <condition id="ARMCM35P CMSIS">
      <description>Generic Arm Cortex-M35P device startup and depends on CMSIS Core</description>
      <require Dvendor="ARM:82" Dname="ARMCM35P*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="ARMCM35P CMSIS GCC">
      <description>Generic Arm Cortex-M35P device startup and depends on CMSIS Core requiring GCC</description>
      <require condition="ARMCM35P CMSIS"/>
      <require condition="GCC"/>
    </condition>

